# brew taps
tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# brew formulae
brew "gh"
brew "git"
brew "tig"

brew "jq"
brew "yq"
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "tldr"
brew "ncdu"
brew "ngrep"
brew "watch"
brew "ffmpeg"
brew "telnet"
cask "iterm2"
brew "docker"
brew "speedtest"

brew "vim"
brew "emacs"
cask "notion"

brew "jenv"
brew "pyenv"
brew "rbenv"

brew "maven"
brew "gradle"

brew "go"
brew "go-bindata"
brew "rust"
brew "haskell-stack"

brew "ant"
brew "automake"
brew "openssl@1.1"
brew "cmake"
brew "coreutils"
brew "pkg-config"

brew "helm"
brew "kubernetes-cli"

brew "portaudio"
brew "protobuf"
brew "prettyping"
brew "terraform"
brew "wireshark"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"

#cask "adoptopenjdk10"
#cask "adoptopenjdk11"
#cask "adoptopenjdk12"
#cask "adoptopenjdk14"
cask "adoptopenjdk15"

# productivity 
cask "zoom"
cask "figma"
cask "slack"
cask "kindle"
cask "spotify"
cask "discord"
cask "insomnia"
cask "cleanshot"
cask "wireshark"
cask "meetingbar"
cask "google-chrome"
cask "google-cloud-sdk"
cask "beekeeper-studio"
cask "visual-studio-code"

#cask "fantastical"
#cask "1password"
#cask "1password-cli"
